; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v5 ?v6)
             (pred_7 ?v2 ?v7)
             (pred_2 ?v5 ?v7)
             (pred_8 ?v4 ?v5 )
	     (pred_10 ?v5)
             (pred_1 ?v11)
             (pred_11 ?v2)
             (pred_12 ?v7)
             (pred_4 ?v5)
             (pred_6 ?v2)
             (pred_3 ?v5)
             (pred_9 ))



(:action op_1
:parameters (?v12 ?v10 ?v13 ?v3)
:precondition (and (pred_1 ?v12) (pred_1 ?v10) (pred_11 ?v13) (pred_12 ?v3)
          (pred_5 ?v12 ?v10) (pred_7 ?v13 ?v3)
                   (pred_2 ?v10 ?v3) (pred_10 ?v12) 
                   (pred_4 ?v10) (pred_6 ?v13))
:effect (and  (pred_3 ?v10) (not (pred_4 ?v10))))


(:action op_4
:parameters (?v12 ?v9)
:precondition (and (pred_1 ?v12) (pred_1 ?v9)
               (pred_10 ?v12) (pred_5 ?v12 ?v9) (pred_3 ?v9))
:effect (and (pred_10 ?v9) (not (pred_10 ?v12))))

(:action op_2
:parameters (?v12 ?v13)
:precondition (and (pred_1 ?v12) (pred_11 ?v13) 
                  (pred_10 ?v12) (pred_8 ?v13 ?v12) (pred_9 ))
:effect (and (pred_6 ?v13)
   (not (pred_8 ?v13 ?v12)) (not (pred_9 ))))


(:action op_3
:parameters (?v12 ?v1 ?v8)
:precondition (and (pred_1 ?v12) (pred_11 ?v1) (pred_11 ?v8)
                  (pred_10 ?v12) (pred_6 ?v8) (pred_8 ?v1 ?v12))
:effect (and (pred_6 ?v1) (pred_8 ?v8 ?v12)
        (not (pred_6 ?v8)) (not (pred_8 ?v1 ?v12))))

(:action op_5
:parameters (?v12 ?v13)
:precondition (and (pred_1 ?v12) (pred_11 ?v13) 
                  (pred_10 ?v12) (pred_6 ?v13))
:effect (and (pred_9 ) (pred_8 ?v13 ?v12) (not (pred_6 ?v13)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_25 obj_30 obj_32 obj_09 obj_28 obj_05 obj_07 obj_17 obj_12 obj_20 obj_13 obj_24 obj_02 obj_29 obj_23 obj_27 obj_22 obj_19 obj_14 obj_08 obj_01 obj_03 obj_10 obj_31 obj_06
    obj_26 obj_21 obj_04
    obj_18 obj_16 obj_11 obj_15
    )

    (:init
       (pred_9)

       (pred_1 obj_25)
       (pred_1 obj_30)
       (pred_1 obj_32)
       (pred_1 obj_09)
       (pred_1 obj_28)
       (pred_1 obj_05)
       (pred_1 obj_07)
       (pred_1 obj_17)
       (pred_1 obj_12)
       (pred_1 obj_20)
       (pred_1 obj_13)
       (pred_1 obj_24)
       (pred_1 obj_02)
       (pred_1 obj_29)
       (pred_1 obj_23)
       (pred_1 obj_27)
       (pred_1 obj_22)
       (pred_1 obj_19)
       (pred_1 obj_14)
       (pred_1 obj_08)
       (pred_1 obj_01)
       (pred_1 obj_03)
       (pred_1 obj_10)
       (pred_1 obj_31)
       (pred_1 obj_06)
       (pred_12 obj_26)
       (pred_12 obj_21)
       (pred_12 obj_04)
       (pred_11 obj_18)
       (pred_11 obj_16)
       (pred_11 obj_11)
       (pred_11 obj_15)

       (pred_5 obj_25 obj_05)
       (pred_5 obj_25 obj_30)
       (pred_5 obj_30 obj_07)
       (pred_5 obj_30 obj_32)
       (pred_5 obj_30 obj_25)
       (pred_5 obj_32 obj_17)
       (pred_5 obj_32 obj_09)
       (pred_5 obj_32 obj_30)
       (pred_5 obj_09 obj_12)
       (pred_5 obj_09 obj_28)
       (pred_5 obj_09 obj_32)
       (pred_5 obj_28 obj_20)
       (pred_5 obj_28 obj_09)
       (pred_5 obj_05 obj_13)
       (pred_5 obj_05 obj_07)
       (pred_5 obj_05 obj_25)
       (pred_5 obj_07 obj_24)
       (pred_5 obj_07 obj_17)
       (pred_5 obj_07 obj_30)
       (pred_5 obj_07 obj_05)
       (pred_5 obj_17 obj_02)
       (pred_5 obj_17 obj_12)
       (pred_5 obj_17 obj_32)
       (pred_5 obj_17 obj_07)
       (pred_5 obj_12 obj_29)
       (pred_5 obj_12 obj_20)
       (pred_5 obj_12 obj_09)
       (pred_5 obj_12 obj_17)
       (pred_5 obj_20 obj_23)
       (pred_5 obj_20 obj_28)
       (pred_5 obj_20 obj_12)
       (pred_5 obj_13 obj_27)
       (pred_5 obj_13 obj_24)
       (pred_5 obj_13 obj_05)
       (pred_5 obj_24 obj_22)
       (pred_5 obj_24 obj_02)
       (pred_5 obj_24 obj_07)
       (pred_5 obj_24 obj_13)
       (pred_5 obj_02 obj_19)
       (pred_5 obj_02 obj_29)
       (pred_5 obj_02 obj_17)
       (pred_5 obj_02 obj_24)
       (pred_5 obj_29 obj_14)
       (pred_5 obj_29 obj_23)
       (pred_5 obj_29 obj_12)
       (pred_5 obj_29 obj_02)
       (pred_5 obj_23 obj_08)
       (pred_5 obj_23 obj_20)
       (pred_5 obj_23 obj_29)
       (pred_5 obj_27 obj_01)
       (pred_5 obj_27 obj_22)
       (pred_5 obj_27 obj_13)
       (pred_5 obj_22 obj_03)
       (pred_5 obj_22 obj_19)
       (pred_5 obj_22 obj_24)
       (pred_5 obj_22 obj_27)
       (pred_5 obj_19 obj_10)
       (pred_5 obj_19 obj_14)
       (pred_5 obj_19 obj_02)
       (pred_5 obj_19 obj_22)
       (pred_5 obj_14 obj_31)
       (pred_5 obj_14 obj_08)
       (pred_5 obj_14 obj_29)
       (pred_5 obj_14 obj_19)
       (pred_5 obj_08 obj_06)
       (pred_5 obj_08 obj_23)
       (pred_5 obj_08 obj_14)
       (pred_5 obj_01 obj_03)
       (pred_5 obj_01 obj_27)
       (pred_5 obj_03 obj_10)
       (pred_5 obj_03 obj_22)
       (pred_5 obj_03 obj_01)
       (pred_5 obj_10 obj_31)
       (pred_5 obj_10 obj_19)
       (pred_5 obj_10 obj_03)
       (pred_5 obj_31 obj_06)
       (pred_5 obj_31 obj_14)
       (pred_5 obj_31 obj_10)
       (pred_5 obj_06 obj_08)
       (pred_5 obj_06 obj_31)
       (pred_4 obj_24)
       (pred_4 obj_13)
       (pred_4 obj_25)
       (pred_4 obj_28)
       (pred_2  obj_24 obj_26)
       (pred_2  obj_13 obj_21)
       (pred_2  obj_25 obj_04)
       (pred_2  obj_28 obj_04)
       (pred_3 obj_30)
       (pred_3 obj_32)
       (pred_3 obj_09)
       (pred_3 obj_05)
       (pred_3 obj_07)
       (pred_3 obj_17)
       (pred_3 obj_12)
       (pred_3 obj_20)
       (pred_3 obj_02)
       (pred_3 obj_29)
       (pred_3 obj_23)
       (pred_3 obj_27)
       (pred_3 obj_22)
       (pred_3 obj_19)
       (pred_3 obj_14)
       (pred_3 obj_08)
       (pred_3 obj_01)
       (pred_3 obj_03)
       (pred_3 obj_10)
       (pred_3 obj_31)
       (pred_3 obj_06)

       (pred_7  obj_18 obj_26)
       (pred_7  obj_16 obj_21)
       (pred_7  obj_11 obj_04)
       (pred_7  obj_15 obj_21)
       (pred_8 obj_18 obj_06)
       (pred_8 obj_16 obj_22)
       (pred_8 obj_11 obj_05)
       (pred_8 obj_15 obj_29)
       (pred_10 obj_29)
    )

    (:goal (and
       (pred_8 obj_16 obj_07)
       (pred_8 obj_15 obj_22)
    ))
(:constraints
  (always (not (pred_10 obj_02)))
)
)

; plan
1. (op_2 obj_29 obj_15)
   deleted: (pred_8 obj_15 obj_29) (pred_9)
   added: (pred_6 obj_15)
   goals met: 0 of 2
2. (op_4 obj_29 obj_12)
   deleted: (pred_10 obj_29)
   added: (pred_10 obj_12)
   goals met: 0 of 2
3. (op_4 obj_12 obj_17)
   deleted: (pred_10 obj_12)
   added: (pred_10 obj_17)
   goals met: 0 of 2
4. (op_4 obj_17 obj_07)
   deleted: (pred_10 obj_17)
   added: (pred_10 obj_07)
   goals met: 0 of 2
5. (op_4 obj_07 obj_05)
   deleted: (pred_10 obj_07)
   added: (pred_10 obj_05)
   goals met: 0 of 2
6. (op_1 obj_05 obj_13 obj_15 obj_21)
   deleted: (pred_4 obj_13)
   added: (pred_3 obj_13)
   goals met: 0 of 2
7. (op_3 obj_05 obj_11 obj_15)
   deleted: (pred_6 obj_15) (pred_8 obj_11 obj_05)
   added: (pred_6 obj_11) (pred_8 obj_15 obj_05)
   goals met: 0 of 2
8. (op_4 obj_05 obj_07)
   deleted: (pred_10 obj_05)
   added: (pred_10 obj_07)
   goals met: 0 of 2
9. (op_5 obj_07 obj_11)
   deleted: (pred_6 obj_11)
   added: (pred_9) (pred_8 obj_11 obj_07)
   goals met: 0 of 2
10. (op_4 obj_07 obj_05)
   deleted: (pred_10 obj_07)
   added: (pred_10 obj_05)
   goals met: 0 of 2
11. (op_2 obj_05 obj_15)
   deleted: (pred_8 obj_15 obj_05) (pred_9)
   added: (pred_6 obj_15)
   goals met: 0 of 2
12. (op_4 obj_05 obj_13)
   deleted: (pred_10 obj_05)
   added: (pred_10 obj_13)
   goals met: 0 of 2
13. (op_4 obj_13 obj_27)
   deleted: (pred_10 obj_13)
   added: (pred_10 obj_27)
   goals met: 0 of 2
14. (op_4 obj_27 obj_22)
   deleted: (pred_10 obj_27)
   added: (pred_10 obj_22)
   goals met: 0 of 2
15. (op_3 obj_22 obj_16 obj_15)
   deleted: (pred_6 obj_15) (pred_8 obj_16 obj_22)
   added: (pred_6 obj_16) (pred_8 obj_15 obj_22)
   goals met: 1 of 2
16. (op_4 obj_22 obj_27)
   deleted: (pred_10 obj_22)
   added: (pred_10 obj_27)
   goals met: 1 of 2
17. (op_4 obj_27 obj_13)
   deleted: (pred_10 obj_27)
   added: (pred_10 obj_13)
   goals met: 1 of 2
18. (op_4 obj_13 obj_05)
   deleted: (pred_10 obj_13)
   added: (pred_10 obj_05)
   goals met: 1 of 2
19. (op_4 obj_05 obj_07)
   deleted: (pred_10 obj_05)
   added: (pred_10 obj_07)
   goals met: 1 of 2
20. (op_3 obj_07 obj_11 obj_16)
   deleted: (pred_6 obj_16) (pred_8 obj_11 obj_07)
   added: (pred_6 obj_11) (pred_8 obj_16 obj_07)
   goals met: 2 of 2
